```
pip install mysql-connector-python
```
- Make a connection
- maker a cursor --> used for executing the queries 
- Output gets stored in cursor and acts as a FileHandling Pointer
- cursor.column_names: has the column names of the last executed query

In [1]:
import mysql.connector
import pandas as pd

In [2]:
connection = mysql.connector.connect(user='root',password='1234')

In [3]:
cursor = connection.cursor()

In [7]:
cursor.execute('show databases')

In [8]:
for ele in cursor:
    print(ele)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('school',)
('sys',)
('world',)

In [9]:
cursor.execute('use school')

In [10]:
for ele in cursor:
    print(ele)

In [11]:
cursor.execute('show tables')

In [12]:
for ele in cursor:
    print(ele)

('students',)

In [18]:
cursor.execute('select * from students')

In [14]:
for ele in cursor:
    print(ele)

(1, 'Shubham', 12, 18, 'M', 'B')
(2, 'Manu', 11, 15, 'M', 'A')
(3, 'pari', 12, 16, 'F', 'A')
(4, 'Ishan', 12, 19, 'M', 'B')

In [19]:
cursor.column_names

('roll_no', 'name', 'class', 'age', 'gender', 'division')

In [20]:
df = pd.DataFrame(cursor,columns=cursor.column_names)

In [21]:
df

   roll_no     name  class  age gender division
0        1  Shubham     12   18      M        B
1        2     Manu     11   15      M        A
2        3     pari     12   16      F        A
3        4    Ishan     12   19      M        B